Revit 2024 API
StructuralSectionConcreteRectangleCut Constructor
 Creates a new instance of Structural Section Concrete Rectangle Cut shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public StructuralSectionConcreteRectangleCut(
	double width,
	double height,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double topCutWidth,
	double topCutHeight,
	double bottomCutWidth,
	double bottomCutHeight
)
Visual Basic
Public Sub New ( _
	width As Double, _
	height As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	principalAxesAngle As Double, _
	sectionArea As Double, _
	perimeter As Double, _
	nominalWeight As Double, _
	momentOfInertiaStrongAxis As Double, _
	momentOfInertiaWeakAxis As Double, _
	elasticModulusStrongAxis As Double, _
	elasticModulusWeakAxis As Double, _
	plasticModulusStrongAxis As Double, _
	plasticModulusWeakAxis As Double, _
	torsionalMomentOfInertia As Double, _
	torsionalModulus As Double, _
	warpingConstant As Double, _
	shearAreaStrongAxis As Double, _
	shearAreaWeakAxis As Double, _
	topCutWidth As Double, _
	topCutHeight As Double, _
	bottomCutWidth As Double, _
	bottomCutHeight As Double _
)
Visual C++
public:
StructuralSectionConcreteRectangleCut(
	double width,
	double height,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double topCutWidth,
	double topCutHeight,
	double bottomCutWidth,
	double bottomCutHeight
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle
Type: System.Double
 Rotation angle between the principal axes and cross section reference planes.
sectionArea
Type: System.Double
 Cross section area.
perimeter
Type: System.Double
 Painting surface of the unit length.
nominalWeight
Type: System.Double
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis
Type: System.Double
 Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis
Type: System.Double
 Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis
Type: System.Double
 Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis
Type: System.Double
 Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis
Type: System.Double
 Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis
Type: System.Double
 Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia
Type: System.Double
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus
Type: System.Double
 Section modulus for calculations of torsion stresses (Ct)
warpingConstant
Type: System.Double
 Warping constant (Cw, Iomega, H)
shearAreaStrongAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
topCutWidth
Type: System.Double
 Section width right Cut.
topCutHeight
Type: System.Double
 Section height right Cut.
bottomCutWidth
Type: System.Double
 Section width left Cut.
bottomCutHeight
Type: System.Double
 Section height left Cut.
See Also
StructuralSectionConcreteRectangleCut Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace